tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "blendle/blendle" tap "boz/repo"
tap "buo/cask-upgrade"
tap "codeship/taps"
tap "gobuffalo/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
cask "adoptopenjdk8"
# Java build tool
brew "ant"
# SSL/TLS cryptography library
brew "openssl"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Friendly powerful distributed version control system
brew "bazaar"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Like cat but displays content with syntax highlighting
brew "ccat"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Command-line tool for Amazon Route 53
brew "cli53"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Collection of tools for managing UNIX services
brew "daemontools"
# Tools for building TCP client-server applications
brew "ucspi-tcp"
# D.J. Bernstein's DNS tools
brew "djbdns"
# Pack, ship and run any application as a lightweight container
brew "docker"
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Machine driver for xhyve
brew "docker-machine-driver-xhyve"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Distributed revision control system
brew "git"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Generate files and directories from templates in a git repo
brew "giter8"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Go programming environment (1.10)
brew "go@1.10"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Improved colored diff
brew "icdiff"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# The Kubernetes package manager
brew "kubernetes-helm"
# GNOME XML library
brew "libxml2"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Command-line based markdown presentation tool
brew "mdp"
# Scalable distributed version control system
brew "mercurial"
# Cross platform, open source .NET development framework
brew "mono"
# Port scanning utility for large networks
brew "nmap"
# The OCaml package manager
brew "opam"
# OpenShift command-line interface tools
brew "openshift-cli"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# General-purpose scripting language
brew "php@7.1"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Command-line client for Travis CI
brew "travis"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "beeftornado/rmtree/brew-rmtree"
# Quick Kubernetes Namespace and Context Switchers
brew "blendle/blendle/kns", link: false
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# A Go web development eco-system, designed to make your life easier.
brew "gobuffalo/tap/buffalo"
# A tool to install and interact with Jenkins X on your Kubernetes cluster.
cask "1password"
cask "adobe-acrobat-reader"
cask "applepi-baker"
cask "betterzip"
cask "caffeine"
cask "disk-inventory-x"
cask "evernote"
cask "firefox"
cask "fly"
cask "flycut"
cask "gitter"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "licecap"
cask "minikube"
cask "minishift"
cask "obs"
cask "postman"
cask "qlmarkdown"
cask "qlvideo"
cask "rambox"
cask "screenflow"
cask "shortcuts"
cask "slack"
cask "soda-player"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "transmission"
cask "tunnelblick"
cask "vagrant"
cask "vagrant-manager"
cask "vassal"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "zoomus"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
