tap "beeftornado/rmtree"
tap "blendle/blendle"
tap "boz/repo"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/versions"
tap "jenkins-x/jx"
cask "java"
# Java build tool
brew "ant"
# SSL/TLS cryptography library
brew "openssl"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Command-line tool for Amazon Route 53
brew "cli53"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Collection of tools for managing UNIX services
brew "daemontools"
# Go dependency management tool
brew "dep"
# Tools for building TCP client-server applications
brew "ucspi-tcp"
# D.J. Bernstein's DNS tools
brew "djbdns"
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Machine driver for xhyve
brew "docker-machine-driver-xhyve"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Distributed revision control system
brew "git"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Generate files and directories from templates in a git repo
brew "giter8"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Command-line client for the cloud PaaS
brew "heroku"
# Bash and zsh history suggest box
brew "hh"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Improved colored diff
brew "icdiff"
# Manage your Java environment
brew "jenv"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx", args: ["with-short-names"]
# The Kubernetes package manager
brew "kubernetes-helm"
# GNOME XML library
brew "libxml2"
# Java-based project management
brew "maven"
# Command-line based markdown presentation tool
brew "mdp"
# Scalable distributed version control system
brew "mercurial"
# Cross platform, open source .NET development framework
brew "mono"
# Port scanning utility for large networks
brew "nmap"
# The OCaml package manager
brew "opam"
# OpenShift command-line interface tools
brew "openshift-cli"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# General-purpose scripting language
brew "php@7.1"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Build tool for Scala projects
brew "sbt"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line client for Travis CI
brew "travis"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "beeftornado/rmtree/brew-rmtree"
# Quick Kubernetes Namespace and Context Switchers
brew "blendle/blendle/kns"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# A tool to install and interact with Jenkins X on your Kubernetes cluster.
brew "jenkins-x/jx/jx"
cask "1password"
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "applepi-baker"
cask "atom"
cask "disk-inventory-x"
cask "evernote"
cask "fly"
cask "flycut"
cask "franz"
cask "gimp"
cask "gitter"
cask "google-cloud-sdk"
cask "gpgtools"
cask "imageoptim"
cask "importio"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "itsycal"
cask "java9"
cask "keybase"
cask "licecap"
cask "minikube"
cask "minishift"
cask "phpstorm"
cask "postman"
cask "pycharm-ce"
cask "qlmarkdown"
cask "rambox"
cask "screenflow"
cask "screenhero"
cask "shortcuts"
cask "slack"
cask "soda-player"
cask "spectacle"
cask "steam"
cask "transmission"
cask "vagrant"
cask "vagrant-manager"
cask "vassal"
cask "virtualbox"
cask "wireshark"
